Show / Hide Table of Contents
Class BeamData
Provides data of the connected beam
Inheritance
System.Object
OpenObject
OpenElementId
BeamData
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
[DataContract]
public class BeamData : OpenElementId
Properties
Improve this Doc   View Source
AddedMember
Added member
Declaration
[DataMember]
public ReferenceElement AddedMember { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
AddedMemberLength
Added beam lenght
Declaration
[DataMember]
public double AddedMemberLength { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
AutoAddCutByWorkplane
Automaticali add cut by workplane if it not defined
Declaration
[DataMember]
public bool AutoAddCutByWorkplane { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
CrossSectionType
Type of cross section
Declaration
[DataMember]
public string CrossSectionType { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Cuts
Cuts on the beam
Declaration
[DataMember]
public List<CutData> Cuts { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CutData>
Improve this Doc   View Source
IsAdded
Is added beam
Declaration
[DataMember]
public bool IsAdded { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
IsBearingMember
Is beam bearing member
Declaration
[DataMember]
public bool IsBearingMember { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
IsNegativeObject
Is negative object
Declaration
[DataMember]
public bool IsNegativeObject { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
MirrorY
Mirror by Y
Declaration
[DataMember]
public bool MirrorY { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
MprlName
MPRL name of beam
Declaration
[DataMember]
public string MprlName { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Name
Name of the beam
Declaration
[DataMember]
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
OriginalModelId
Get or set the identification in the original model In the case of the imported connection from another application
Declaration
[DataMember]
public string OriginalModelId { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Plates
Plates of the beam
Declaration
[DataMember]
public List<PlateData> Plates { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<PlateData>
Improve this Doc   View Source
RefLineInCenterOfGravity
The reference line of the member is in the center of gravity of the cross-section
Declaration
[DataMember]
public bool RefLineInCenterOfGravity { get; set; }
Property Value
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source